pljakobs/Esp32HardwarePwm/src/include/Esp32HardwarePwm.h
/**
 * @file
 * @brief  ESP32 Hardware PWM (LEDC) driver
 * @author Peter Jakobs http://github.com/pljakobs
 *
 * Sming Framework Project - Open Source framework for high efficiency native ESP8266 development.
 * Created 2015 by Skurydin Alexey
 * http://github.com/SmingHub/Sming
 * All files of the Sming Core are provided under the LGPL v3 license.
 *
 * This library wraps the ESP32 LEDC peripheral to provide hardware PWM with:
 * - Configurable duty resolution (1–20 bits) and frequency
 * - Multiple independent instances with distinct timer configurations
 * - Phase shifting (hpoint) for EMI/noise/power-spike reduction
 * - Spread spectrum modulation
 * - Hardware-accelerated linear fading
 * - Per-channel FIFO and CYCLIC fade queues with automatic sequencing
 * - Split of large-range fades to work around the LEDC step_num ≤ 1023 limit
 * - Per-reload timing compensation to reduce accumulated latency in queued sequences
 * - Application callbacks: fade-done, queue-empty, cyclic-wrap, queue-error
 */

/** @defgroup esp32_hw_pwm ESP32 Hardware PWM
 *  @brief    ESP32 LEDC hardware PWM driver with fade queue support
 *  @{
 */

#pragma once

#include <atomic>
#include <cstdint>
#include <vector>
#include <driver/ledc.h>
#include <esp_timer.h>
#include <soc/soc_caps.h>
#include <array>
#include <esp_attr.h>
#include <Delegate.h>
#include <SimpleTimer.h>
#include <memory>

// ---------------------------------------------------------------------------
// Per-channel fade queue depth — override before including this header.
// ---------------------------------------------------------------------------
#ifndef FADE_QUEUE_DEPTH
#define FADE_QUEUE_DEPTH 10
#endif

// ---------------------------------------------------------------------------
// Debug level control for Esp32HardwarePwm
// Set HW_PWM_DEBUG via compiler flag (e.g. -DHW_PWM_DEBUG=2) or in component.mk.
// This define is intentionally NOT set here — it only applies to Esp32HardwarePwm.cpp.
//   0 = no logging (default)
//   1 = errors only   (debug_e)
//   2 = errors + info (debug_e, debug_i)
//   3 = full          (debug_e, debug_i, debug_d)
// ---------------------------------------------------------------------------

/**
 * @brief ESP32 Hardware PWM driver wrapping the LEDC peripheral.
 *
 * Provides a channel-indexed interface over the ESP32 LEDC hardware with:
 *
 * **Basic PWM**
 * - Arbitrary duty resolution (1–20 bit) and frequency per timer
 * - Instantaneous duty set (`setDutyChan`) and percentage helpers
 * - Phase shifting (hpoint) per channel — off, auto-distributed, or manual
 * - Spread spectrum modulation for EMI reduction
 *
 * **Hardware fading**
 * - Single-shot linear fades: `fadeChan` / `fadePercentChan`
 * - Automatic splitting of large-range fades to avoid the LEDC
 *   `step_num ≤ 1023` quantisation limit (up to −18 % timing error at 12-bit
 *   without splitting)
 *
 * **Fade queue**
 * - Per-channel ring-buffer queue (`fadeChan(..., queue=true)`) in FIFO or CYCLIC mode
 * - FIFO: auto-starts on first entry; fires `onQueueEmpty` when drained
 * - CYCLIC: seeded then started with `startQueue`; fires `onCyclicWrap` on
 *   each loop
 * - Per-reload timing correction (`reloadOverheadUs`) to compensate ISR→task
 *   dispatch latency accumulating over many queued steps
 * - `onFadeDone` callback after every individual fade (including queue steps)
 * - `onQueueError` callback for `QUEUE_FULL` and `SPLIT_DEGRADED` conditions
 *
 * **Safe teardown**
 * - `hasPendingCallbacks()` lets callers defer `delete` until all queued
 *   task-context dispatches have drained, preventing use-after-free
 *
 * Channel index is the 0-based position in the `pins[]` vector passed to the
 * constructor, independent of GPIO number or LEDC hardware channel number.
 *
 * @note RAII — all LEDC resources are released in the destructor.
 * @note Not copyable or movable.
 */
class Esp32HardwarePwm
{
public:
	static constexpr uint8_t BadChannel = 0xff; ///< Invalid PWM channel indicator

	/**
     * @brief Defines PWM duty cycle percentage (0.0 = off, 100.0 = full on)
     */
	using DutyCycle = float;

	// -----------------------------------------------------------------------
	// Fade queue types
	// -----------------------------------------------------------------------

	enum class QueueMode : uint8_t {
		FIFO,   ///< Queue drains and stops; onQueueEmpty fires when exhausted
		CYCLIC, ///< Playback loops back to entry 0 endlessly; onCyclicWrap fires on each loop
	};

	/** @brief Error codes delivered to the onQueueError callback */
	enum class QueueError : uint8_t {
		QUEUE_FULL,		///< No space in the queue; the fade was not enqueued
		SPLIT_DEGRADED, ///< Fade needed splitting but segments didn't fit; pushed unsplit (timing accuracy reduced)
	};

	// -----------------------------------------------------------------------
	// Configuration types — declared before constructors so they are visible
	// in constructor parameter lists.
	// -----------------------------------------------------------------------

	enum class PhaseShiftMode : uint8_t {
		OFF,	///< No phase shifting
		AUTO,   ///< Automatic phase shifting based on channel index
		MANUAL, ///< Manual phase shifting using provided hpoint values
	};

	enum class SpreadSpectrumMode : uint8_t {
		OFF, ///< Spread spectrum disabled
		ON,  ///< Spread spectrum enabled
	};

	struct PhaseShiftConfig {
		PhaseShiftMode mode = PhaseShiftMode::OFF; ///< Phase shift mode
		std::vector<int> manual_hpoints = {};	  ///< hpoint values for MANUAL mode, one per pin
	};

	struct SpreadSpectrumConfig {
		SpreadSpectrumMode mode = SpreadSpectrumMode::OFF; ///< Spread spectrum mode
		uint8_t WidthPercent = 0;						   ///< Frequency deviation as percentage of base frequency
		uint16_t Subsampling = 0;						   ///< Number of PWM cycles between frequency updates
	};

	struct TimerConfig {
		ledc_mode_t speed_mode = LEDC_LOW_SPEED_MODE;	///< LEDC speed mode
		ledc_timer_bit_t resolution = LEDC_TIMER_10_BIT; ///< Duty resolution in bits
		ledc_timer_t timer_num = LEDC_TIMER_0;			 ///< LEDC timer index
		uint32_t frequency = 1000;						 ///< PWM frequency in Hz
		ledc_clk_cfg_t clk_cfg = LEDC_AUTO_CLK;			 ///< Clock source
	};

