pljakobs/Esp32HardwarePwm/src/include/Esp32HardwarePwm.h
	struct Config {
		ledc_channel_t channelStart = LEDC_CHANNEL_0; ///< First LEDC channel to allocate
		TimerConfig timer = {};						  ///< Timer configuration
		PhaseShiftConfig phaseShift = {};			  ///< Phase shift configuration
		SpreadSpectrumConfig spreadSpectrum = {};	 ///< Spread spectrum configuration
	};

	// -----------------------------------------------------------------------
	// Constructors / destructor
	// -----------------------------------------------------------------------

	/**
     * @brief Construct PWM instance with default configuration
     * @param pins Vector of GPIO pins to control
     */
	Esp32HardwarePwm(std::vector<uint8_t>& pins) : Esp32HardwarePwm(pins, Config{})
	{
	}

	/**
     * @brief Construct PWM instance with custom configuration
     * @param pins Vector of GPIO pins to control
     * @param config PWM configuration parameters
     */
	Esp32HardwarePwm(std::vector<uint8_t>& pins, const Config& config);

	/**
     * @brief Destructor - automatically releases all allocated resources
     */
	~Esp32HardwarePwm();

	// Disable copy constructor and assignment operator to prevent resource conflicts
	Esp32HardwarePwm(const Esp32HardwarePwm&) = delete;
	Esp32HardwarePwm& operator=(const Esp32HardwarePwm&) = delete;

	// -----------------------------------------------------------------------
	// Timer / global configuration
	// -----------------------------------------------------------------------

	/** @brief Change PWM frequency for all channels
     * @param frequency New frequency in Hz
     * @return true if successful, false otherwise
     * @note This affects all channels sharing the same timer
     */
	bool setFrequency(uint32_t frequency);

	/** @brief Get current PWM frequency
     * @return Frequency in Hz
     */
	uint32_t getFrequency() const;

	/** @brief Set PWM period in microseconds
     * @param period_us Period in microseconds
     * @return true if successful, false otherwise
     */
	bool setPeriod(uint32_t period_us);

	/** @brief Get PWM period in microseconds
     * @return Period in microseconds
     */
	uint32_t getPeriod() const;

	/** @brief Get maximum duty cycle value
     * @return Maximum duty value based on resolution
     */
	uint32_t getMaxDuty() const;

	/** @brief Get duty resolution in bits
     * @return Resolution in bits (1-20)
     */
	uint8_t getResolution() const;

	/** @brief Get total number of configured channels
     * @return Number of channels
     */
	uint8_t getPinCount() const
	{
		return static_cast<uint8_t>(pins_.size());
	}

	/** @brief Check if PWM instance is properly initialized
     * @return true if initialized, false otherwise
     */
	bool isInitialized() const
	{
		return initialized_;
	}

	/** @brief Apply pending duty changes to all channels
     * @note Only needed when update_immediately was set to false
     */
	void update();

	/** @brief Stop PWM output on all channels
     * @param idle_level Level to set pins when stopped (0 or 1)
     */
	void stopAll(bool idle_level = false);

	// -----------------------------------------------------------------------
	// Primary interface — channel-indexed (preferred)
	// Channel index is the 0-based position in the pins[] vector passed to
	// the constructor, independent of GPIO number or LEDC hardware channel.
	// -----------------------------------------------------------------------

	/** @brief Set duty cycle for a channel (absolute value)
     * @param channel Channel index
     * @param duty Duty cycle value (0 to getMaxDuty())
     * @param update_immediately Apply changes immediately (default: true)
     * @return true if successful, false otherwise
     */
	bool setDutyChan(uint8_t channel, uint32_t duty, bool update_immediately = true);

	/** @brief Get duty cycle for a channel (absolute value)
     * @param channel Channel index
     * @return Current duty cycle value (0 to getMaxDuty())
     */
	uint32_t getDutyChan(uint8_t channel);

	/** @brief Set duty cycle for a channel as a percentage
     * @param channel Channel index
     * @param percentage Duty cycle percentage (0.0 to 100.0)
     * @param update_immediately Apply changes immediately (default: true)
     * @param cie Apply CIE 1931 perceptual correction (default: false)
     * @return true if successful, false otherwise
     */
	bool setDutyChanPercent(uint8_t channel, DutyCycle percentage, bool update_immediately = true, bool cie = false)
	{
		if(percentage < 0.0f) {
			percentage = 0.0f;
		}
		if(percentage > 100.0f) {
			percentage = 100.0f;
		}
		float Y = cie ? cie1931Linear(percentage) : (percentage / 100.0f);
		return setDutyChan(channel, static_cast<uint32_t>(Y * getMaxDuty()), update_immediately);
	}

	/** @brief Get duty cycle for a channel as a percentage
     * @param channel Channel index
     * @param cie Return CIE 1931 perceptual percentage (default: false = linear)
     * @return Duty cycle percentage (0.0 to 100.0)
     */
	DutyCycle getDutyChanPercent(uint8_t channel, bool cie = false)
	{
		uint32_t duty = getDutyChan(channel);
		uint32_t max_duty = getMaxDuty();
		if(max_duty == 0) {
			return 0.0f;
		}
		float Y = static_cast<float>(duty) / max_duty;
		return cie ? cie1931Inverse(Y) : (Y * 100.0f);
	}

	/** @brief Set phase shift for a channel (absolute hpoint value)
     * @param channel Channel index
     * @param phase_shift Phase shift value in PWM resolution counts (0 to getMaxDuty())
     * @param update_immediately Apply changes immediately (default: true)
     * @return true if successful, false otherwise
     */
	bool setPhaseShiftChan(uint8_t channel, uint32_t phase_shift, bool update_immediately = true);

	/** @brief Set phase shift for a channel as a percentage of the PWM period
     * @param channel Channel index
     * @param percentage Phase shift percentage (0.0 = no shift, 100.0 = full period)
     * @param update_immediately Apply changes immediately (default: true)
     * @return true if successful, false otherwise
     */
	bool setPhaseShiftChanPercent(uint8_t channel, DutyCycle percentage, bool update_immediately = true)
	{
		if(percentage < 0.0f) {
			percentage = 0.0f;
		}
		if(percentage > 100.0f) {
			percentage = 100.0f;
		}
		uint32_t phase_shift = static_cast<uint32_t>(percentage * getMaxDuty() / 100.0f);
		return setPhaseShiftChan(channel, phase_shift, update_immediately);
	}

	/** @brief Enable hardware fade functionality
     * @return true if successful, false otherwise
     * @note Called automatically by the constructor; exposed for manual control.
     */
	bool enableFade();

	/** @brief Disable hardware fade functionality */
	void disableFade();

	/** @brief Hardware linear fade on a channel (absolute duty target).
	 * @param channel_idx Channel index
	 * @param target_duty Target duty value (0 to getMaxDuty())
	 * @param fade_time_ms Duration in milliseconds
	 * @param queue If false (default), resets the queue and starts immediately.
	 *              If true, enqueues the fade for sequential playback.
	 * @return true if started/enqueued successfully
	 */
	bool fadeChan(uint8_t channel_idx, uint32_t target_duty, uint32_t fade_time_ms, bool queue = false);

	/** @brief Hardware linear fade on a channel (percentage target).
	 * @param channel_idx Channel index
	 * @param target_pct Target duty as percentage (0.0–100.0)
	 * @param fade_time_ms Duration in milliseconds
	 * @param cie Apply CIE 1931 perceptual correction (default: false)
	 * @param queue If false (default), resets the queue and starts immediately.
	 *              If true, enqueues the fade for sequential playback.
	 * @return true if started/enqueued successfully
	 */
	bool fadePercentChan(uint8_t channel_idx, DutyCycle target_pct, uint32_t fade_time_ms, bool cie = false,
						 bool queue = false)
	{
		if(target_pct < 0.0f) {
			target_pct = 0.0f;
		}
		if(target_pct > 100.0f) {
			target_pct = 100.0f;
		}
		float Y = cie ? cie1931Linear(target_pct) : (target_pct / 100.0f);
		return fadeChan(channel_idx, static_cast<uint32_t>(Y * getMaxDuty()), fade_time_ms, queue);
	}

	/** @brief Returns true while a hardware fade is in progress on the given channel */
	bool isFadingChan(uint8_t channel_idx) const;

	// -----------------------------------------------------------------------
	// Fade queue interface
	// -----------------------------------------------------------------------

	/** @brief Set queue mode for a channel.
	 * Must be called before filling the queue. Changing mode while the queue
	 * is running has undefined behaviour.
	 */
	void setQueueMode(uint8_t channel, QueueMode mode);

	/** @brief Get current queue mode for a channel */
	QueueMode getQueueMode(uint8_t channel) const;

