pljakobs/Esp32HardwarePwm/src/include/Esp32HardwarePwm.h
	uint16_t getQueueEntries(uint8_t channel) const;

	/** @brief Clear the queue for a channel and reset mode to FIFO.
	 * The currently-running hardware fade (if any) completes normally, but no
	 * further queue entries are started and no callbacks fire afterwards.
	 * Queue capacity is preserved.
	 */
	void resetQueue(uint8_t channel);

	/** @brief Explicitly start a queued sequence.
	 * Must be called after seeding a CYCLIC queue (autoStart=false).  For FIFO
	 * queues with autoStart=true this is normally not needed, but can be used
	 * to restart an idle queue.  Returns false if the queue is empty or the
	 * channel is already fading.
	 */
	bool startQueue(uint8_t channel);

	/** @brief Set the maximum number of entries for a channel's queue.
	 * Can only be changed while the queue is empty.  Returns false if the
	 * queue is not empty or depth is zero.
	 */
	bool setQueueCapacity(uint8_t channel, uint16_t depth);

	/** @brief Get the maximum number of entries for a channel's queue */
	uint16_t getQueueCapacity(uint8_t channel) const;

	/** @brief Override the auto-start behaviour for a channel's queue.
	 * setQueueMode() sets autoStart automatically (true for FIFO, false
	 * for CYCLIC).  Use this to override that default.
	 */
	void setQueueAutoStart(uint8_t channel, bool autoStart);

	/** @brief Returns true if the queue starts automatically on first fadeChan(..., queue=true) call */
	bool getQueueAutoStart(uint8_t channel) const;

	// -----------------------------------------------------------------------
	// Hardware calibration
	// -----------------------------------------------------------------------

	/**
	 * @brief Per-(frequency, resolution) measured reload overhead entry.
	 *
	 * Generated by TimingTest_HwPWM: the measured per-step overhead is the
	 * model value plus the latPerStep residual from the CH1 column:
	 *   overheadUs = model + latPerStep_us   (clamped to 0 if negative)
	 */
	struct CalibrationEntry {
		uint32_t frequency;			 ///< PWM frequency in Hz
		ledc_timer_bit_t resolution; ///< Timer resolution
		uint32_t overheadUs;		 ///< Measured per-reload overhead (µs)
	};

	/**
	 * @brief Install a hardware-measured calibration table.
	 *
	 * When a (frequency, resolution) pair matches an entry, its overheadUs
	 * is used instead of the formula (1500 µs + 1 × period).  Call once
	 * before constructing any Esp32HardwarePwm instance — the pointer is
	 * stored but not copied, so the table must remain valid for the
	 * lifetime of the application.
	 *
	 * @param table  Pointer to CalibrationEntry array
	 * @param count  Number of entries
	 */
	static void setCalibrationTable(const CalibrationEntry* table, size_t count);

	/** @brief Override the per-reload overhead used to correct queued fade durations.
	 * Normally auto-computed as (1 PWM period + DISPATCH_LATENCY_US) by the
	 * constructor and by setFrequency().  Set to 0 to disable correction.
	 * @param channel Channel index
	 * @param overheadUs Overhead to deduct per reload, in microseconds
	 */
	void setReloadOverheadUs(uint8_t channel, uint32_t overheadUs);

	/** @brief Get the per-reload overhead currently configured for a channel */
	uint32_t getReloadOverheadUs(uint8_t channel) const;

	/** @brief Callback fired after every individual fade completes (even if more are queued) */
	void setOnFadeDoneCallback(Delegate<void(uint8_t)> cb)
	{
		onFadeDone_ = cb;
	}

	/** @brief Callback fired when a FIFO queue drains to empty */
	void setOnQueueEmptyCallback(Delegate<void(uint8_t)> cb)
	{
		onQueueEmpty_ = cb;
	}

	/** @brief Callback fired each time a CYCLIC queue wraps back to entry 0 */
	void setOnCyclicWrapCallback(Delegate<void(uint8_t)> cb)
	{
		onCyclicWrap_ = cb;
	}

	/** @brief Callback fired when a fadeChan(queue=true) call fails or degrades.
	 *  The callback receives the channel index and the QueueError reason.
	 *  For QUEUE_FULL the fade was not enqueued; for SPLIT_DEGRADED the fade
	 *  was enqueued unsplit (hardware timing accuracy may be reduced). */
	void setOnQueueErrorCallback(Delegate<void(uint8_t, QueueError)> cb)
	{
		onQueueError_ = cb;
	}

	/** @brief Returns true if there are unprocessed ISR results or a
	 *  dispatchFadeCallbacks task already queued in the Sming task queue.
	 *
	 *  Use this before deleting the object from task context to ensure no
	 *  stale task-queue entry still holds a pointer to it:
	 *  @code
	 *    if(pwm->hasPendingCallbacks()) {
	 *        System.queueCallback(tryTeardown);  // re-defer
	 *        return;
	 *    }
	 *    delete pwm;
	 *  @endcode
	 */
	bool hasPendingCallbacks() const
	{
		return pendingFadeCallbacks_.load(std::memory_order_relaxed) != 0 || fadeCallbackQueued_;
	}

	// -----------------------------------------------------------------------
	// Legacy interface — GPIO-pin-indexed (use channel interface for new code)
	// -----------------------------------------------------------------------

	/** @brief Set PWM duty cycle for a specific pin (legacy pin-indexed interface)
     * @param pin GPIO pin number
     * @param duty Duty cycle value (0 to getMaxDuty())
     * @param update_immediately Apply changes immediately (default: true)
     * @return true if successful, false otherwise
     */
	bool setDutyPin(uint8_t pin, uint32_t duty, bool update_immediately = true)
	{
		int idx = getPinIndex(pin);
		if(idx < 0) {
			return false;
		}
		return setDutyChan((uint8_t)idx, duty, update_immediately);
	}

	/** @brief Get PWM duty cycle for a specific pin (legacy pin-indexed interface)
     * @param pin GPIO pin number
     * @return Current duty cycle value
     */
	uint32_t getDutyPin(uint8_t pin)
	{
		int idx = getPinIndex(pin);
		if(idx < 0) {
			return 0;
		}
		return getDutyChan((uint8_t)idx);
	}

	/** @brief Arduino-style analogWrite (legacy)
     * @param pin GPIO pin number
     * @param duty Duty cycle value
     * @return true if successful, false otherwise
     */
	bool analogWrite(uint8_t pin, uint32_t duty)
	{
		return setDutyPin(pin, duty);
	}

	/** @brief Start PWM output on a specific pin (legacy)
     * @param pin GPIO pin number
     * @return true if successful, false otherwise
     */
	bool start(uint8_t pin);

	/** @brief Stop PWM output on a specific pin (legacy)
     * @param pin GPIO pin number
     * @param idle_level Level to set pin when stopped (0 or 1)
     * @return true if successful, false otherwise
     */
	bool stop(uint8_t pin, bool idle_level = false);

	/** @brief Start PWM output on all pins (legacy) */
	void startAll();

