pljakobs/Esp32HardwarePwm/src/include/Esp32HardwarePwm.h
private:
	/** @brief Internal: enqueue a fade (absolute duty). Used by fadeChan(). */
	bool queueDutyChan(uint8_t channel, uint32_t targetDuty, uint32_t fadeTimeMs);

	struct FadeEntry {
		uint32_t targetDuty;
		uint32_t fadeTimeMs;
		bool isPartial = false; ///< True for intermediate segments of a split long-range fade
	};

	struct ChannelFadeQueue {
		std::vector<FadeEntry> entries; ///< Ring-buffer storage (size = queue capacity)
		uint16_t head = 0;				///< Next entry to consume
		uint16_t tail = 0;				///< Next free write slot
		uint16_t count = 0;				///< FIFO: decrements on pop; CYCLIC: fixed after seeding
		uint16_t cycleLen = 0;			///< CYCLIC: number of entries in the cycle
		QueueMode mode = QueueMode::FIFO;
		bool autoStart = true; ///< If true, playback starts on first fadeChan(queue=true); false requires startQueue()
		uint32_t reloadOverheadUs = 0;	 ///< Per-reload overhead subtracted from each step (µs)
		int32_t carryUs = 0;			   ///< Sub-ms accumulator for reload overhead correction
		int32_t quantCarryUs = 0;		   ///< Sub-µs accumulator for cycle_num truncation correction
		bool activeIsIntermediate = false; ///< True when the executing entry is a partial (intermediate) split segment
		bool warnedLowCycleNum = false;	///< Suppress repeat low-cycle_num warnings for this channel
	};

	struct PinConfig {
		uint8_t gpioPin = 0;					 ///< GPIO pin number
		ledc_channel_t channel = LEDC_CHANNEL_0; ///< LEDC hardware channel
		uint32_t currentDuty = 0;				 ///< Last duty value written
		uint32_t targetDuty = 0;				 ///< Target duty for in-progress fade
		int hpoint = 0;							 ///< Phase shift hpoint
		bool isActive = false;					 ///< True when channel is running
	};

	// Context block passed to steadyFadeTimerCb — one per channel, stable address.
	struct SteadyFadeContext {
		Esp32HardwarePwm* self;
		uint8_t channel_idx;
	};
	std::vector<SteadyFadeContext> steadyFadeCtx_;
	std::vector<std::unique_ptr<SimpleTimer>> steadyFadeTimers_;

	TimerConfig timer_;
	SpreadSpectrumConfig spreadSpectrum_;
	esp_timer_handle_t spreadSpectrumTimer_ = nullptr;
	PhaseShiftConfig phaseShift_;
	std::vector<PinConfig> pins_;
	std::vector<ChannelFadeQueue> fadeQueues_;

	bool initialized_ = false;
	bool fadeInstalled_ = false;

	// Per-channel fade-done flags, set from LEDC fade callback (ISR-safe)
	std::array<volatile bool, SOC_LEDC_CHANNEL_NUM> fadeDone_{};

	// ISR → task handoff for fade completion
	// Written from the LEDC fade ISR (potentially on either core) and
	// read+cleared in task context — must be atomic to avoid torn reads
	// on the dual-core ESP32.
	std::atomic<uint32_t> pendingFadeCallbacks_{0};
	volatile bool fadeCallbackQueued_ = false;

	// Application-level callbacks
	Delegate<void(uint8_t)> onFadeDone_;
	Delegate<void(uint8_t)> onQueueEmpty_;
	Delegate<void(uint8_t)> onCyclicWrap_;
	Delegate<void(uint8_t, QueueError)> onQueueError_;

	/**
     * @brief Initialize PWM instance
     * @param pins Array of GPIO pins
     * @param pin_count Number of pins
     * @return true if successful, false otherwise
     */
	bool initialize();

	int getPinIndex(uint8_t gpioPin) const
	{
		for(size_t i = 0; i < pins_.size(); ++i) {
			if(pins_[i].gpioPin == gpioPin) {
				return (int)i;
			}
		}
		return -1;
	}

	/**
     * @brief Get channel info for a specific pin
     * @param pin GPIO pin number
     * @return Pointer to channel info, or nullptr if pin not found
     */
	PinConfig* getPinConfig(uint8_t gpioPin)
	{
		for(auto& pin : pins_) {
			if(pin.gpioPin == gpioPin) {
				return &pin;
			}
		}
		return nullptr;
	}

	/**
     * @brief Calculate hpoint for phase shifting 
	 *        this calculates hpoits such that n channels
	 *        are evenly distributed across the PWM period
     * @param channel_index Index of the channel
     * @return Calculated hpoint value
     */
	int calculateHpoint(uint8_t channel_index) const
	{
		uint32_t max_duty = getMaxDuty();
		return (int)(max_duty * channel_index) / pins_.size();
	};

	/**
     * @brief Start spread spectrum modulation
     * @param frequency Center frequency in Hz
     * @param config Spread spectrum configuration
     * @return true if successful, false otherwise
     **/
	bool setupSpreadSpectrum(int frequency, SpreadSpectrumConfig& config);

	/**
     * @brief Handle spread spectrum modulation
     */
	void handleSpreadSpectrum();

	// Fade callback registered with ledc_cb_register per channel — runs in ISR context
	static bool IRAM_ATTR fadeDoneCallback(const ledc_cb_param_t* param, void* arg);

	// Task-context dispatcher — deferred from ISR via System.queueCallback
	static void dispatchFadeCallbacks(uint32_t param);

	// Dequeue the head entry from a FIFO queue (advances head, decrements count)
	FadeEntry dequeueFifo(ChannelFadeQueue& q);

	// Start the next fade from the queue; returns false if queue empty
	bool startNextFade(uint8_t channel_idx);

	// Raw LEDC hardware fade — used by startNextFade only; bypasses queue and split logic
	bool fadeHwChan(uint8_t channel_idx, uint32_t target_duty, uint32_t fade_time_ms);

	// esp_timer callback — runs in task context, static wrapper required for C function pointer
	static void spreadSpectrumTimerCb(void* arg);

	// SimpleTimer callback for zero-range (x→x) fades — fires after fadeTimeMs elapses
	static void steadyFadeTimerCb(void* arg);

	// -----------------------------------------------------------------
	// CIE 1931 perceptual correction
	// Maps a perceptual lightness percentage (0–100) to a linear
	// duty cycle value using the standard CIE 1931 formula:
	//   L <= 8  →  Y = L / 902.3
	//   L  > 8  →  Y = ((L + 16) / 116)^3
	// -----------------------------------------------------------------
	static float cie1931Linear(float L)
	{
		if(L <= 0.0f) {
			return 0.0f;
		}
		if(L >= 100.0f) {
			return 1.0f;
		}
		if(L <= 8.0f) {
			return L / 902.3f;
		}
		float t = (L + 16.0f) / 116.0f;
		return t * t * t;
	}

	// CIE 1931 inverse: maps linear duty fraction Y (0–1) back to perceptual
	// lightness L (0–100).  Inverse of cie1931Linear.
	//   Y <= 0.008856  →  L = 903.3 × Y
	//   Y  > 0.008856  →  L = 116 × ∛Y − 16
	static float cie1931Inverse(float Y)
	{
		if(Y <= 0.0f) {
			return 0.0f;
		}
		if(Y >= 1.0f) {
			return 100.0f;
		}
		if(Y <= 0.008856f) {
			return Y * 903.3f;
		}
		return 116.0f * cbrtf(Y) - 16.0f;
	}
};

/** @} */
